

let str = `“有你的帮助就可以避免，”他接着说，“如果会有这么大的危险——如果他就是使她的生活增加一种烦恼的原因——那么，我以为我正好有理由走极端！我希望你诚诚恳恳告诉我，若是失去了他，凯瑟琳会不会很难过：就是怕她会难过，这才使我忍住。你这就看得出我们两人情感中间的区别了：如果他处在我的地位，而我处在他的地位，当然我恨他恨得要命，我绝不会向他抬一只手。你要是不信，那也由你！只要她还要他作伴，我就绝不会把他从她身边赶走。她对他的关心一旦停止，我就要挖出他的心，喝他的血！可是，不到那时候——你要是不相信我，那你是不了解我——不到那时候，我宁可寸磔而死，也不会碰他一根头发！”“可是，”我插口说，“你毫无顾忌地要彻底毁掉她那完全恢复健康的一切希望，在她快要忘了你的时候却硬要把你自己插到她的记忆里，而且把她拖进一场新的纠纷和苦恼的风波中去。“你以为她快要忘了我吗？”他说。“啊，耐莉！你知道她没有忘记！你跟我一样地知道她每想林惇一次，她就要想我一千次！在我一生中最悲惨的一个时期，我曾经有过那类的想法：去年夏天在我回到这儿附近的地方时，这想法还缠着我；可是只有她自己的亲自说明才能使我再接受这可怕的想法。到那时候，林惇才可以算不得什么，辛德雷也算不得什么，就是我做过的一切梦也都不算什么。两个词可以概括我的未来——死亡与地狱：失去她之后，生存将是地狱。但是，我曾经一时糊涂，以为她把埃德加·林惇的情爱看得比我的还重。如果他以他那软弱的身心的整个力量爱她八年，也抵不上我一天的爱。凯瑟琳有一颗和我一样深沉的心：她的整个情感被他所独占，就像把海水装在马槽里。呸！他对于她不见得比她的狗或者她的马更亲密些。他不像我，他本身有什么可以被她爱：她怎么能爱他本来没有的东西呢？”“凯瑟琳和埃德加像任何一对夫妇那样互相热爱，”伊莎贝拉带着突然振作起来的精神大叫。“没有人有权利用那样的态度讲话，我不能听人毁谤我哥哥还不吭声。”“你哥哥也特别喜欢你吧，是不是？”希刺克厉夫讥讽地说。“他以令人惊奇的喜爱任你在世上漂泊。”“他不晓得我受的什么罪，”她回答。“我没有告诉他。”“那么你是告诉了他什么啦：你写信了，是不是？”`;


console.log("句子拆分");




let str2 = `把属于她家的个个都吊死，除了一个，可能她把那个例外当作她自己了。但是任何残忍都引不起她厌恶，我猜想只要她这宝贝的本人的安全不受损害，她对于那种残忍还有一种内心的赞赏哩！是啊，那种可怜的，奴性的，下流的母狗——纯粹的白痴——竟还梦想我能爱她岂不是荒谬透顶！告诉你的主人，耐莉，说我一辈子也没遇见过像她这样的一个下贱东西。她甚至都玷辱了林惇的名声，我试验她能忍受的能力，而她总还是含羞地谄媚地爬回来，由于实在想不出新的办法，我有时候都动了慈悲心肠哩！但是，也告诉他，请他放宽他那一副傲然的手足之情的心肠吧。我是严格遵守法律限制的。直到眼前这段时期，我一直避免给她最轻微的借口要求离开；不仅如此，谁要是分开我们，她也不会感谢的。如果她愿走，她可以走；她在我跟前所引起的我的厌恶已经超过我折磨她时所得到的满足了。”`;