let text = `02
别一味自足
“你们的焦土政策进展如何呀？”菜园自留地经理问得幽默，但这项“政策”本身却是在绝望中出台的。2012年夏天在英格兰种粮食是件可怕的事，这一年，降雨量创下了最高纪录。农民们发现小麦产量下降了近1[5]%，苹果产量更是降了近25%。连全职工作的种植专业户都在苦苦挣扎，搞家庭菜园经验最丰富的老手也抱怨颗粒无收。

我们在紧巴巴的后花园种植水果和蔬菜已经4年了，耕作新租的菜园自留地才是第一个种植季。划出小块土地供人们自己种粮食，是英国延续了好几个世纪的传统，现代租用菜园的形式则是1908年《自留地法案》（Small Holdings and Allotments Act ）通过之后才出现的。该法案责令地方当局“为愿意购买或租用土地种植作物的人提供小块土地”。按1832年《自留地法案》的说法，这么做是“保障穷人的福祉和幸福”，当时，这类荒地主要是燃烧取暖的干草和木材的来源。就在前些年，租用菜园自留地的还主要是工薪族，而近来中产阶级发现了这片新天地，结果，一些地区的租地候补名单变得比顶尖公立学校的入学申请名单还长。我们的自留地等了四年多才申请到，跟平均候补时间差不多。

不过，跟无处不在的旋花草[5] 相比，雨水太多倒是个小问题了。我们跟它的第一场战役只让它略微撤退，可它的生命力太过蓬勃，很快就死灰复燃了。我们只好给所有的地面都蒙上黑色塑料膜，让野草与生长所需的阳光隔绝，就算不能根除，也指望来年它的势头能弱些，更好控制。

我们不该心存幻想，以为“种植食物很容易”。如果真那么容易，几千年前就该消灭饥饿了。种植是跟恶劣天气、害虫、病害和杂草的不懈斗争，但栽培一小块土地，也有道不完的好理由。许多人都发现它跟生活的其他方面形成了有益的对比：相当安静，不嘈杂；空旷，不用整天对着四堵墙；与土地和植物接触，而非受其保护。好些人用“治疗”这个词来形容，其实一点儿也不夸张。用正规课程讲授的“园艺疗法”治疗学习障碍症患者、孤寡老人或抑郁人士，似乎都挺管用。

不过，有一种关于自留地的价值观，在我看来似乎是完全搞错了方向。自给自足似乎总是挺有吸引力，尤其是在一个不确定的世界里。对于个人来说，它假设的理想情况是：用自己种的地里出产的果实喂饱自己，偶尔用盈余跟附近的其他人互换有无。退而求其次，至少能够靠自己以及当地社区种植的粮食存活。对于国家来说，最低限度的自给自足是，不靠进口就能养活本国居民。表面上看起来，自给自足让我们更安全，更少依赖他人，故此也就有了更大的适应性。可惜这是错的。独立并不会让我们更强大，相互依存才会。

自留地与相互依存

自留地就是一个看到相互依存发挥作用的好地方。自留地的存在，有赖将共有土地划分给个人耕种的正式制度，共有土地由地方政府提供，由中央政府授权。自留地的经营靠自留地持有者构成的委员会，个人能否耕种土地，在很大程度上取决于这一管理方式是否有效开展。水箱的提供、小径铺设的木片配送、堆肥式厕所的架设，靠的都是集体而非个人行动。自留地持有人并非独行其是，而是要紧紧依靠同侪。

除了正式的协调形式，自留地还是一块促进非正式互助的肥沃温床。如果有人外出，邻居会互相帮忙照看土地；他们还分享盈余的作物和种子，因为知道别人将来也会分享；他们还乐于分享经验、专业知识和工具。自留地不仅仅是功利的非正式经济体，也是非常适合交际的舞台。短短几个星期，我们认识的同道耕种户，比住了5年的街道上的邻居还多。此类互动还有着可敬的平等倾向。在这里，人们问你的第一个问题不是“你是干什么的”，沾满泥巴的旧衣服也掩藏了许多社会阶层的线索。人们能不顾社会背景打成一片的公共场合不多，医院是其中之一，自留地也是。

接下来的问题是，耕种作物到底需要些什么东西？肥料是从全国连锁店买的，或是让当地农户配送的；工具和鸡舍大多是中国制造而非产自英国；操作技术手册是波兰印刷、亚马逊配送的。家庭种植见不得人的秘密是：种植远非什么节俭之道，每年支付的费用往往会超过作物的价值，买来的东西多过了种出来的东西。

最后，还有一些有关作物本身的事实。如果没有从美国买来的土豆和西红柿，从荷兰买来的橙色胡萝卜，从伊朗买来的菠菜，从意大利买来的防风草，以及其他各种外来作物，现代自留地的样子可就惨淡多了。所以，总体而言，自留地是一个绝妙的例子，它示范了人类如何依靠社会、历史链条织就的复杂网络，让相隔很远的彼此发生联系。这提醒我们：人类之所以能够饮食丰足，完全是因为相互依存；人类这一物种成功繁衍和生产力创造的根源，正来自社会交往和交换能力。我们应该欣慰，这些链条促进了人类发展，而不是自欺欺人地想着所有的事情都该自己做。

别落入本地产的狭隘圈套

公共领域愈发迫切地需要对付强调自给自足的狭隘崇拜热潮。在如今神圣的三位一体“索尔派”[6] ——吃时令的（seasonal）、有机的（organic）、本地产（local）食物的教条里，本地产是重中之重。比如，美国近来的一次调查发现，半数以上的消费者认为购买本地产食物比购买有机食物还重要。购买本地产食物有许多充分的理由，其中有一个原因，顶尖大厨们比其他任何人都更清楚。

2011年，斯德哥尔摩的一家米其林二星级餐厅弗兰森/林德伯格（Frantzén/Lindeberg）吹嘘，他们95%的食材都来自瑞典境内。我跟主厨弗兰森见面时他解释说，一般而言，生气勃勃、有机的当地产食材更好，因为它们更新鲜，没有冷冻、存储、长途运输过。然而，并非所有食材都是这样，所以，2012年弗兰森又发推文说，“大家对食材有点过分关注了。它们打哪儿来不重要，重要的是味道。”

以瑞典松露为例。“它比不上意大利阿尔巴松露，比不上要用几个星期运送来的特等澳大利亚松露，更比不上法国佩里戈尔黑松露。”他说。同样，英国人的厨房，靠着地中海的橄榄油、中东的海枣、中美洲的可可、巴西的咖啡和印度的茶叶才变得丰富起来。餐厅供应商查理·希克斯（Charlie Hicks）也赞同：“诚实的厨师会告诉你，‘品质第一，本地产次之。’一家可爱的乡村酒店完美地展现了这一点。他们有座砌了围墙的小果园，种了各种奇妙的东西。”可就在那里，他们对希克斯说：“不能拿‘本地产’来为‘难吃’当挡箭牌啊。”

没错，本地产往往意味着更新鲜、更美味，但并非总是如此。本地产也不必然意味着更可持续发展。近年来“食物里程”（food miles）的概念很热门，许多小商店常吹嘘食物从农场运到店里的距离有多短，但这并不见得一定减少了对环境的影响。来看两个例子。伦敦的大量食物都是从外地运来的，距离最近的土豆产地是埃塞克斯，但当地的产量比土豆的主要产地林肯郡低得多。所以，要是计算一袋土豆的总碳排放足迹，得把种植总面积、所需粪肥和化肥，以及收割、运输所用的能量考虑在内。林肯郡的土豆虽然更遥远，给地球造成的总负担却比更近的埃塞克斯要轻柔。

更极端的例子是新西兰黄油。新西兰基本上跟任何国家都隔着几千英里，所以，该国的国际贸易受到了新兴的“本地产崇拜”思潮威胁。以下研究成果不免让我感到欣慰。林肯大学发现，英国生产每吨乳固体的碳排放量是2921千克，而新西兰仅为1423千克（包括运输到英国所产生的碳排放）。新西兰各方面的条件都适合全年户外放牧，这意味着只需相对较少的生产性碳投入就能生产出黄油和羊肉。此外，集装箱货轮是世界范围内最高效的运输形式。一项研究发现，一整条集装箱货轮从中国运到欧洲的二氧化碳排放量，仅相当于欧洲长途货运200公里。因此，一瓶法国葡萄酒从马赛运到纽约，碳足迹说不定少于一瓶美国加利福尼亚州葡萄酒用卡车送到同一地点。一小块来自新西兰的黄油，碳足迹没准比英国本地黄油更小。

所以，本地产并不一定意味着更美味、更可持续发展。那么，它至少维持了一个地区的自给自足吧？在我居住的布里斯托尔，“本地产”崇拜党声势浩大，自给自足是其整套说辞的重要组成部分。布里斯托尔食品政策委员会则发布了《食品宪章》（Food Charter ），它有十大宏愿，其中之一就是“让本市尽量能满足自己的粮食需求，从而使食品更安全”。

然而，尽量从本地获取食物并不会增强我们的灵活度。相反，我们更容易受到伤害。纵观历史，由于本地粮食歉收，又没有能力从外部获取食物而导致的饥荒，在世界各地屡见不鲜。过于依赖本地农业会造成什么后果，让我们看看2012年的一例警示：英国糟糕的小麦产量逼得霍维斯面包（Hovis bread）的生产商英国第一食品公司（Premier Foods）放弃了只使用英国产面粉的承诺。食品经济里有许多条供应线，有些长，有些短，依靠它们，我们才可能全年都吃得好，而不用去看老天爷的脸色。

贸易和交换（有时甚至跨越很长的距离），让我们每个人都过得更好。贸易让人得以专注于自己最擅长的事情，实现了事事亲力亲为条件下无法达到的规模经济。一个人专职负责为村里其他人烤面包，其他人就能生产更多大家所需的别的东西。在西班牙海边小镇格拉纳达的铁门城堡（Castell de Ferro），渔民只捕鱼，住在山上的农民只种植杏树。农民买船或者渔民种杏树毫无意义，因为他们只需要交换盈余，就既有了鱼，又有了杏仁。其他任何动物都没有这种复杂的劳动分工和交换制度，而这正是为什么我们叫做“智人”的原因：智人，“Homo cambiens”——“懂得交换的人”。

可以说，贸易是人类文明的根源。遵守契约，需要相互信任，以及发达的文明社会。那么，“减少进口就不会变得太脆弱”的观点为什么又有强大的吸引力呢？在某种程度上，这是因为到了一个可悲的阶段：我们似乎更信任自然而非人类同胞。较之雨水太多或者太少使产量减少，我们更害怕反复无常的外国人切断供给。受过教育、经常倡导地方主义的城市居民，对自然多么善变完全没有体会。自留地本可以好好给他们上上课，只可惜他们跟赌徒一样，往往只记得自己得胜的时节。

2012年，我们的覆盆子种得挺好。走进商店，看到一小盒子覆盆子要卖足足3英镑，而且还比自己早晨刚摘下来的新鲜果子质量差、数量少，这种感觉是何等满足呀！更何况，还能连续采摘好几个星期的果实呢。自然真慷慨呀，不是吗？我们这么想着，却忘了自家地里的豆荚干瘪如柴，寥寥可数的几枚西红柿青绿瘦小，注定不会成熟。相信大自然总是给予馈赠的人，并不真正了解大自然。

对乡土物产的理想化，有可能造就狭隘的心态，把人局限在生养自己的文化当中。这一点，在粮食主权运动中有过表现，几个不必要的字眼败坏了这一运动原本可圈可点的定义：“粮食主权就是民众通过生态无害、可持续的方法生产与文化相适合的健康食物的权利，以及民众界定自身食物和农业体系的权利。”人当然有权从自己所属的文化里获取食物，但原因并不在于这些食物“更适合”他们所属的文化。硬说香蕉属于非洲人，苹果属于英国人，未免太接近赤裸裸的种族主义观念，比如墨索里尼曾对小麦征收进口关税，鼓励意大利人只吃本国原产的作物。我不是说地方主义等同于法西斯主义，只想提醒大家：良性的家乡自豪感，和有害的、分裂的民族主义，有时只有一条微妙的界线。

从本地产到确定产地

“慢食”（Slow Food）运动的发起人卡洛·佩特里尼（Carlo Petrini）提出了“良性全球化”（virtuous globalisation）的主张，即通过贸易和交换，让地方传统与更广阔的世界相联系，巩固传统，并使之可持续发展。

全球化存在的真正问题，跟贸易双方隔得远近毫无关系。我们时代的痼疾，是贸易的去人性化，以及将所有产品和生产者全都简化成“商品”的倾向。这种疾病最糟糕的症状是2008年金融危机。金融市场变得太过抽象，无从体现售卖真实商品与真实的人之间的真实关系，有些时候，计算机程序分析的甚至是尚不存在的东西的贸易统计数据。这几乎肯定是股市和楼市出现泡沫的一个原因：贸易价值和实际价值脱钩了。此种情况之所以存在，部分是因为“智人”已经变质成了“经济人”，即全神贯注追求金钱收益最大化的物种。这当然不是说，所有的贸易建立在更个性化的基础上都会更好。举个例子，个体户的作坊就没法经济地生产汽车或者计算机。

我认为，崇拜地方主义的思潮一定程度上表达了在经济生活中夺回人性尺度的愿望。但它误解了问题本身。重要的不是食物是否产自本地，而是看它是否有来源，即是不是来自一个能够待以尊重、公平的产地和生产商——哪怕我们与其只有间接的关系。比如，在其他条件相同的前提下，购买来自肯尼亚一家管理完善的庄园出产的咖啡，就比购买千篇一律的企业集团以工业条件喂养的英国奶牛出产的牛奶更讲道德。我们希望做的是支持本地区和其他地区有人情味的道德企业。

我们提倡，买任何东西的时候都确定产地，不管相隔多远，都知道它来自什么地方。一位英国的西班牙食品进口商描述了理想状况：“我们的产品来自有历史、有经验的小公司，以及在各地区之间建立起卓越且独特关系的地方生产商。”例如，伦敦人到高档餐厅圣约翰就着埃克尔斯特产的葡萄干馅饼品尝柯卡姆夫人牌兰开夏奶酪，其对本地产的支持程度就不亚于兰开夏人到当地的伯里集市（Bury Market）买这款奶酪。

亲本地化和全球化实现调和的一个例子来自“公平贸易运动”（Fairtrade movement）[7] ，它尝试为发展中国家的生产商锁定更划算的交易。国际公平贸易组织（Fairtrade International）CEO哈丽雅特·兰姆（Harriet Lamb）用“沙漏经济”这个词向我形容了如今的局面。比如，世界各地约2500万小农户生产了全球咖啡产量的80%，这些咖啡又为数百万甚至数十亿的消费者所饮用。但生产者和消费者之间只有少数几家中间商，全球咖啡贸易的40%掌握在4家公司手中，60%的零售贸易由5家全球品牌把持。全球化的问题不是在沙漏两端的人际交换，而是他们只能通过面目模糊、地点模糊的跨国中介互相交换。总体上，这些全球巨头吸纳了世界各地的商品，将之混合融化，创造出同质化的统一产品，消除了各地商品所带地方特色的一切痕迹。然而，如果生产者和消费者之间能够重新建立起更直接的联系，那么人们对全球化的大部分不安感就会消失，并代之以更积极的喜悦感。

地方通常与全球相对，而“从本地产到确定产地”则意味着一种从当前社群拓展到更宽广所在的贸易关系。所以，英国慢食运动的负责人、热心支持地方饮食传统的凯瑟琳·加佐利（Catherine Gazzoli）为我准备了一顿完全使用意大利食材做的午餐，我并不觉得有什么矛盾：圣达涅的切片生火腿（prosciutto crudo di San Daniele）；弗留利的丽斐酒庄白葡萄酒（Livio Felluga）；帕马森奶酪；在慢食国际都灵食品展上买的意式小方饺，搭配到访友人带来的那波利番茄酱。只有她同事做的蛋糕是英国产的，但这顿饭完全吻合全球化愿景，即在有着强烈地方传统的人与场所之间进行交换、交流。

要转变我们对本地化真正价值的理解，换一种语言或许有所帮助。意大利人不怎么说“本地的”（località），而是更爱说“特色的”（tipicalità）。如果一种食物是某地独有的，那它就是“特产”，如果形容一条鱼是“特产”，它的特点就有了价值，自不待言它也是一种恩赐。这种说法的好处是，你大可以在伯明翰吃托斯卡纳的特色炖豆，并不一定非得吃本地炖豆。事实上，使用曼彻斯特优质食材做成的米兰烩饭，比在米兰用微波炉加热的烩饭更具特色。

自己种植粮食、支持本地生产商诚然值得称道，但我们不该错误地把它看成是一种独立宣言。相反，我们应该明白，没有其他人、其他地方和其他文化，我们自己就什么也不是。人类的相互依存，让我们必须拓宽自己的视野、打开大门，我们不能被“全球资本主义”的同质化力量给淹没，而要跟千百万像我们一样热爱自己故土的其他人进行交换。`