
// 从后（右）加0，输出移位之后的十进制数


console.log(3 >> 1);  // 1


// 11
// 1

console.log(4 >> 1);
// 100
// 10 => 2

console.log(3 >> 2);  // 0


// 11111
// 
let v = 2**4 + 2**3 + 2**2 + 2**1 + 2**0;
console.log("11111:", v); // 31

console.log(31 >> 1);  // 15
// 1111

console.log(31 >> 2);  // 7
// 111

console.log(31 >> 3);  // 3
// 11

console.log(31 >> 4);  // 1
// 1

console.log(31 >> 5);  // 0
// 0

console.log(32 >> 5);  // 1




//  21  10101

console.log("取21的第1位二进制数:", 21 >> 0 & 1);  // 1
console.log("取21的第2位二进制数:", 21 >> 1 & 1);  // 0
console.log("取21的第3位二进制数:", 21 >> 2 & 1);  // 1
console.log("取21的第4位二进制数:", 21 >> 3 & 1);  // 0
console.log("取21的第5位二进制数:", 21 >> 4 & 1);  // 1